frontend/controllers/SearchController.php

    public function actionShowDetail($id){
        $arrData = Properties::find()
                        ->andWhere('id = '.$id)
                        ->one();
        $txtUsername = '';
        $txtOwnername = '';
        $intCustomerType = '';
        $intLoginUserID = '';
        $intOwnerID = '';
        $arrAgentUsers = [];
        $intLoginUserID = Yii::$app->user->id;
        $intOwnerID = $arrData['agent_id'];
        $arrMessage =[];
        $arrGalleryImages = \frontend\models\PropertyImageGalleries::find()
                                ->andWhere('property_id = '.$id)
                                ->all();

        if(!Yii::$app->user->isGuest):
            $arrMessage = \frontend\models\Messages::find()
                            ->andWhere('user_id = '.$intLoginUserID.' or agent_id = '.$intLoginUserID)
                            ->andWhere('property_id='.$id)
                            ->asArray()
                            ->all();
            $arrLoginUser = \frontend\models\Users::find()
                                ->andWhere('id = '.$intLoginUserID)
                                ->asArray()
                                ->one();
            $txtUsername = $arrLoginUser['name'];
            $intCustomerType= $arrLoginUser['role_id'];
            $txtOwnername = \frontend\models\Users::find()
                                ->andWhere('id = '.$intOwnerID)
                                ->asArray()
                                ->one()['name'];
---
SELECT * FROM `properties` WHERE id = 2
SELECT * FROM `property_image_galleries` WHERE property_id = 2
SELECT * FROM `messages` WHERE (user_id = 5 or agent_id = 5) AND (property_id=2)
SELECT * FROM `user` WHERE id = 5

    public function actionMessage(){
        $arrPost = Yii::$app->request->post();
        $propertyMOdel = new Properties();
        $txtMessage = 'hello';
        $intOwnerId = $arrPost['intOwnerId'];
        $intUserId = $arrPost['intUserId'];
        $intPropertyId = $arrPost['intPropertyId'];

        $model = new \frontend\models\Messages();
        $model->message = $txtMessage;
        $model->user_id = $intUserId;
        $model->agent_id  =$intOwnerId;
        $model->property_id = $intPropertyId;
        $model->id = $propertyMOdel->getNextId('messages','id');

        $model->save();
---
INSERT INTO `messages` (`message`, `user_id`, `agent_id`, `property_id`, `id`) VALUES ('hello', 1, 5, 2, 5)

    public function getMessage($intPropertyId,$intUserId,$intOwnerId){
        $arrMessage = \frontend\models\Messages::find()
                            ->andWhere('user_id = '.$intUserId)
                            ->andWhere('property_id='.$intPropertyId)
                            ->asArray()
                            ->all();
        $strContent = '';
        $txtUsername = \frontend\models\Users::find()->andWhere('id = '.$intUserId)->one()['name'];
         $txtOwnerName = \frontend\models\Users::find()->andWhere('id = '.$intOwnerId)->one()['name'];
---
SELECT * FROM `messages` WHERE (user_id = 1) AND (property_id=2)
SELECT * FROM `user` WHERE id = 1
SELECT * FROM `user` WHERE id = 5