frontend/views/layouts/main.php

SELECT `role_id` FROM `user` WHERE id = 5
---

    if(!empty(Yii::$app->user->id)):
        $intLoginUserId = Yii::$app->user->id;
        $arrCustomerType = frontend\models\Users::find()
                                ->select('role_id')
                                ->andWhere('id = '.$intLoginUserId)
                                ->asArray()
                                ->one();