frontend/views/search/show-detail.php

SELECT * FROM `user` WHERE id = 1
---
                                if(!empty($arrAgentUsers)):
                        $str = '<ul class="side-tabs">';
                        foreach ($arrAgentUsers as $key=>$intUserId):
                            $txtName = frontend\models\Users::find()->andWhere('id = '.$intUserId)->one()->name;